<template>
  <div class="l-wrap">
    <div class="l-main">
      <div class="secondary-wrap">
        <ul class="breadcrumb-list">
          <li class="item"><nuxt-link to="/" class="link">TOP</nuxt-link><i class="ico-arrow-right"/></li>
          <li class="item"><nuxt-link to="/cases" class="link">事例</nuxt-link><i class="ico-arrow-right"/></li>
          <li class="item"><span class="current">全国200拠点を巻き込む基幹システム刷新。テックタッチの操作ガイドだけで、マニュアルも研修もなくスムーズに利用開始できました</span></li>
        </ul>
        <div class="inner">
          <div class="article-heading">
            <h1 class="title">全国200拠点を巻き込む基幹システム刷新。テックタッチの操作ガイドだけで、マニュアルも研修もなくスムーズに利用開始できました</h1>
            <div class="date">2020.12.09</div>
            <div class="mainImg">
              <img class="img" src="../../assets/img/cases/01_sega/img_main.jpg" alt="全国200拠点を巻き込む基幹システム刷新。テックタッチの操作ガイドだけで、マニュアルも研修もなくスムーズに利用開始できました">
            </div>
          </div>
          <div class="index-box">
            <div class="title">目次</div>
            <ul class="indexList">
              <li class="item"><a class="link" href="#index01">基幹システムの刷新にともないテックタッチを導入</a></li>
              <li class="item"><a class="link" href="#index02">操作マニュアルや研修会なしで、新システムの利用を促進</a></li>
              <li class="item"><a class="link" href="#index03">新システムの利用促進や負担軽減に有用だと判断</a></li>
              <li class="item"><a class="link" href="#index04">テックタッチに対する要望・期待</a></li>
            </ul>
          </div>
          <div class="article-box">
            <p>ゲームセンターなどアミューズメント施設を運営している株式会社セガ エンタテインメント（以下、セガ エンタテインメント）では、全国200拠点を結ぶ基幹システム（ERP）の刷新にともないテックタッチを導入。操作ガイドをリアルタイムで表示することで、操作マニュアル作成や研修を実施することなくスムーズなシステムの導入を実現。テックタッチを導入した経緯と効果について、詳しく伺いました。</p>

            <h2 id="index01">基幹システムの刷新にともないテックタッチを導入</h2>
            <h3>テックタッチの利用状況について教えてください</h3>
            <p>当社では、約20年ぶりに新しく導入した基幹システムの操作ガイドにテックタッチを利用しています。システムの機能は約50種類ありますが、手順をわかりやすくするため個別の作業フローに分けて、約200の操作ガイドを用意しています。</p>
            <h3>操作ガイド作成の体制について教えてください</h3>
            <p>今回はリリース前のシステムなのでガイド作成を外部に任せるのは難しく、社内で作成しました。プログラミングは不要で、プレゼンテーションソフトでオブジェクトやアニメーションを作るときのように、システムを実際に操作しながら作成できるので、慣れればテックタッチの操作自体は難しいことはありません。テックタッチの条件分岐機能などを使えばより複雑なガイドも作れると思いますが、今回はシステムも新しく、テックタッチの利用も初めてなので、分かりやすいようシンプルさを重視しました。</p>
            <p>一方、より網羅的で、システムの操作方法だけでなく業務フローもカバーするガイドとするため、ボリュームは当初の予定より増やしました。期間は、専任担当者1名で、約3か月間となります。</p>

            <h2 id="index02">操作マニュアルや研修会なしで、新システムの利用を促進</h2>
            <figure>
              <img src="../../assets/img/cases/01_sega/img_01.jpg" alt="株式会社セガ エンタテインメント 管理本部 ITソリューション部 部長 河合英雄氏">
              <figcaption>株式会社セガ エンタテインメント 管理本部 ITソリューション部 部長 河合英雄氏</figcaption>
            </figure>
            <h3>テックタッチの導入効果について教えてください</h3>
            <p>コロナ禍により対面での研修が難しくなっていた中、基幹システムの刷新にあたり、スムーズなシステムの定着・習熟度向上といった成果につながり、現場だけでなく運営側の負担も大いに軽減することができました。旧システムを導入した20年前の現場対応は、今回とは比較にならないほど大変だったと聞いています。各効果の詳細は次の通りです。</p>
            <h4>【効果1】現場（利用者）の負担軽減</h4>
            <p>新システムに対して、現場の負担や戸惑いがまったくなかったというわけにはいきませんが、操作ガイドに対する評価は高く、利用者アンケートを見ると約8割が「操作ガイドが用意されていて良かった」と答えています。操作マニュアルの閲覧や研修会などに時間や手間を割くことなく、新システムを短期間で使えるようになったのは、テックタッチ導入の重要な成果であることは間違いありません。</p>
            <p>また、決算時の作業など、通常の作業とは異なる業務にも操作ガイドがあることで、現場の負担が軽減されたと考えています。研修を受けた人しか使えず属人化したり、指導に時間と手間を割かなければならないといった事態を防ぐことにもつながると期待しています。</p>
            <h4>【効果2】運営側の負担軽減</h4>
            <p>今回はガイドを作ったので操作マニュアルは作っていません。研修・教育などの手間もほとんどかかっておらず、操作に関する問い合わせなどに対する運営側の負担も最小限に抑えることができました。システムが仕様変更になった場合でも、テックタッチのガイドはレイアウトの変更などには自動で追従するため、マニュアルを作り直して配布したり再研修などを行ったりする必要がないのも、大きな成果だと捉えています。</p>
            <h4>【効果3】システム利用の習熟度が向上・見える化</h4>
            <p>テックタッチの利用履歴を分析すると、操作ガイドの利用頻度は時間の経過にともない減少傾向にあります。システムへの入力頻度が下がったわけではないので、システム利用の習熟度が向上していると解釈できます。これまで感覚でしか理解できなかった利用状況がこのように可視化されることで、現場での利用状況も客観的に把握できました。今後、システムの利用しやすさや機能向上にも役立てることができると考えています。</p>
            <h4>【効果4】コロナ禍でのスムーズなシステム導入</h4>
            <p>コロナウイルス感染拡大による影響が大きな時期に、新システムをカットオーバーせざるを得なかったのですが、集合研修や現地に出向いてのサポートが難しい状況でも、スムーズに移行することができたと感じています。結果論ですが、テックタッチのおかげでウイルス感染のリスクも必要最低限に抑えられたと思います。</p>
            <h3>操作ガイドだけで、すぐに新システムを使えるようになったのでしょうか？</h3>
            <p>現場には、テックタッチの操作ガイドを見ながら一通り新システムを操作してもらうことを徹底し、またわからないことがあれば社内ポータルの掲示板でやり取りすることで回答を共有し、効率的にガイドに慣れてもらうよう工夫しました。もちろん、上手く使えない利用者もいましたが、個人差はあるものの「旧システムよりも使いやすくなった」、「作業効率が上がった」という声が多く聞かれました。</p>

            <h2 id="index03">新システムの利用促進や負担軽減に有用だと判断</h2>
            <figure>
              <img src="../../assets/img/cases/01_sega/img_02.jpg" alt="株式会社セガ エンタテインメント 管理本部 ITソリューション部 IT企画課 スペシャリスト 山崎朝樹氏">
              <figcaption>株式会社セガ エンタテインメント 管理本部 ITソリューション部 IT企画課 スペシャリスト 山崎朝樹氏</figcaption>
            </figure>
            <h3>テックタッチを導入した経緯について教えてください</h3>
            <p>旧基幹システムは約20年前にスクラッチ開発したものでアミューズメント施設ならではの機能も網羅していました。ただ、さすがに老朽化している面があり、現在のビジネススタイルに対応させ、業務の効率化を進めるため、刷新することに決めました。</p>
            <p>旧システムは、利用者目線で見ると、慣れもあり、だれかに聞けば教えてもらえるといった環境でした。一方、新しいシステムはERPパッケージソフトを一部カスタマイズしたもので、導入に合わせてペーパーレス化をはじめ業務フローを最適化した部分も多く、またWebシステムなので操作手順や使い勝手も従来とはまるで異なります。利用者はエンジニア的な経験や知識を持っているわけではなく、PCやWebシステムに不慣れな者も少なくありません。また、開発・運営側の私たちも、新システムに関して完全に習熟しているとは言いがたい状況です。</p>
            <p>かといって新しいシステムに慣れるまでに時間をかけてしまうと、現場の業務に支障を来してしまうだけでなく、会社全体の業務も滞ってしまいかねません。</p>
            <p>当初はこのような課題を解決する決定打はなく、いわゆる操作画面のキャプチャと説明文を付記した操作手順マニュアルを用意して、何らかの研修を実施するつもりでした。しかし、展示会でテックタッチのデモンストレーションを見たとき、直感的ではありますが、これは新システムの利用促進や負担軽減に有用だと考え、すぐに導入の検討を開始し、デモ版で動作確認をした上で導入を決めました。</p>
            <h3>テックタッチの導入を決めた理由を教えてください</h3>
            <p>導入を決めた主なポイントは次の通りです。</p>
            <ul>
              <li>利用者が操作に迷わないように、次にすべきことを常に画面上で案内できる</li>
              <li>操作マニュアルなどを閲覧しながら作業する必要がなく、シームレスに操作できる</li>
              <li>入力制限や入力ルールのチェックができるので、漏れやミスの削減につながる</li>
              <li>操作ガイドの開発や修正が容易で、社内で対応できる</li>
              <li>基幹システム（Webシステム）に影響（修正）や負担がかからない</li>
              <li>クラウドサービスなので、導入や運用の負荷がかからない</li>
            </ul>

            <h2 id="index04">テックタッチに対する要望・期待</h2>
            <figure>
              <img src="../../assets/img/cases/01_sega/img_03.jpg" alt="株式会社セガ エンタテインメント 管理本部 ITソリューション部 IT企画課 松田一志氏">
              <figcaption>株式会社セガ エンタテインメント 管理本部 ITソリューション部 IT企画課 松田一志氏</figcaption>
            </figure>
            <h3>今後の展開予定について教えてください</h3>
            <p>基幹システムを使っている店舗のリーダー層にとっては、お客様に楽しんで頂く場を提供するために使う時間を最大化することが最も重要です。そのため、システムの入力作業はできるだけスムーズにし、システムを開けば操作ガイドに従い誰でも、何を入力すべきか把握できる環境が理想です。そこで、今後は個々の操作方法だけでなくさらに業務フローの全体像を分かりやすく見せ、各業務にガイドを紐付けた形へと発展させていきたいと考えています。</p>
            <p>また、ほかの社内システムにおける利用価値もあると思うので、活用を検討していきたいと考えています。</p>
            <h3>テックタッチに対する要望や期待などあれば、お聞かせ願えますでしょうか</h3>
            <p>操作ガイドの作成に際してはリモートで画面を共有しながらひとつひとつ、実現方法を一緒になって考えてくれ、導入の検討中も、機能説明など、対応が迅速かつ丁寧でとても助かりました。</p>
            <p>今後も、テックタッチの安定した運用と機能向上、そして、これまでと変わらない対応をお願いしたいと思います。</p>
          </div>
          <div class="client-detail-box">
            <img class="logo" src="../../assets/img/logo-sega.jpg" alt="セガ エンタテインメント">
            <div class="content">
              <div class="name">株式会社セガ エンタテインメント</div>
              <p class="description">「楽し場創造会社」 になるというビジョンを掲げて活動しているセガ エンタテインメントは世界一の楽しい時間と空間を提供し笑顔と感動を創造することを使命として、最新VRゲームを導入した進化型ゲームセンターをはじめ、人気アニメキャラとのコラボカフェなど、全国にセガブランドのアミューズメント施設を展開している。</p>
              <p class="url"><a href="https://www.sega-entertainment.jp" target="_blank">https://www.sega-entertainment.jp</a></p>
              <p class="note">※記載の担当部署は、取材時（2020年10月）の組織名です。</p>
            </div>
          </div>
          <nuxt-link to="/cases" class="btn -md -primary">事例一覧へ</nuxt-link>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from 'nuxt-property-decorator'

@Component
export default class News extends Vue {
  data = {
    companyName: '',
    divisionName: '',
    contactName: '',
    email: '',
    phoneNumber: '',
    numberOfEmployees: '',
    category: '',
    content: ''
  }

  meta = {
    title: '全国200拠点を巻き込む基幹システム刷新。テックタッチの操作ガイドだけで、マニュアルも研修もなくスムーズに利用開始できました',
    description: 'ゲームセンターなどアミューズメント施設を運営している株式会社セガ エンタテインメントでは、全国200拠点を結ぶ基幹システム（ERP）の刷新にともないテックタッチを導入。操作ガイドをリアルタイムで表示することで、操作マニュアル作成や研修を実施することなくスムーズなシステムの導入を実現。テックタッチを導入した経緯と効果について、詳しく伺いました。',
    type: 'article',
    url: 'https://techtouch.jp/cases/sega',
    image: 'https://techtouch.jp/ogp.png'
  }

  head() {
    return {
      title: this.meta.title,
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: this.meta.description
        },
        { hid: 'og:type', property: 'og:type', content: this.meta.type },
        { hid: 'og:title', property: 'og:title', content: this.meta.title },
        {
          hid: 'og:description',
          property: 'og:description',
          content: this.meta.description
        },
        { hid: 'og:url', property: 'og:url', content: this.meta.url },
        { hid: 'og:image', property: 'og:image', content: this.meta.image }
      ]
    }
  }
}
</script>

<style lang="stylus">
@import '../../assets/css/base/mixin.styl'
@import '../../assets/css/base/variables.styl'
@import '../../assets/css/base/reset.styl'
@import '../../assets/css/layout/layout.styl'
@import '../../assets/css/element/btn.styl'
@import '../../assets/css/component/secondary-wrap.styl'
@import '../../assets/css/component/breadcrumb-list.styl'
@import '../../assets/css/component/article-heading.styl'
@import '../../assets/css/component/article-box.styl'
@import '../../assets/css/component/index-box.styl'
@import '../../assets/css/component/client-detail-box.styl'
</style>
